uhnp/src/DataProcessors/тн_ПереносПереоценкиРасчетовССотрудникамиВУУ/тн_ПереносПереоценкиРасчетовССотрудникамиВУУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>тн_ПереносПереоценкиРасчетовССотрудникамиВУУ</name>
  <comment>// Выполнение задач №000040800</comment>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

uhnp/src/InformationRegisters/ТекущиеКадровыеДанныеСотрудников/ТекущиеКадровыеДанныеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущиеКадровыеДанныеСотрудников</name>
  <resources>
    <name>ТекущееПодразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ТекущаяДолжность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновноеРабочееМестоВОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьТекущаяДолжностьПоШтатномуРасписанию</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПриема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущийВидЗанятости</name>
    <type>
      <types>EnumRef.ВидыЗанятости</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьТекущийВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровССотрудниками</types>
    </type>
  </resources>
  <resources>
    <name>ОформленПоТрудовомуДоговору</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьТекущаяТерритория</name>
    <type>
      <types>CatalogRef.ТерриторииВыполненияРабот</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>22</precision>
        <scale>20</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>тнПодразделение</name>
    <comment>Выполнение задач №000041300</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТекущаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоНаправлениямДеятельности</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаПР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаВР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаУУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаФО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеКорректироватьСтоимостьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

uhnp/src/AccumulationRegisters/ПрочиеДоходы/ПрочиеДоходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПрочиеДоходы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетСебестоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КорНаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРасчета</name>
    <type>
      <types>DocumentRef.РегистраторРасчетаСебестоимости</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗакрытияМесяца</name>
    <type>
      <types>EnumRef.РежимыЗакрытияМесяца</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИсточника</name>
    <type>
      <types>EnumRef.ВидыИсточниковДвижений</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДоходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаДоходов</name>
    <type>
      <types>Characteristic.СтатьиДоходов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/AccumulationRegisters/ПрочиеАктивыПассивы/ПрочиеАктивыПассивы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПрочиеАктивыПассивы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>РасчетСебестоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетПартий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИсточника</name>
    <type>
      <types>EnumRef.ВидыИсточниковДвижений</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>EnumRef.ИсточникиУправленческогоБаланса</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/Enums/ИсточникиУправленческогоБаланса/ИсточникиУправленческогоБаланса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИсточникиУправленческогоБаланса</name>
  <enumValues>
    <name>АмортизацияНМА</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияОС</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеДокументы</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредстваБезналичные</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредстваВКассахККМ</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредстваВПути</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредстваНаличные</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредстваУПодотчетныхЛиц</name>
  </enumValues>
  <enumValues>
    <name>ИнвестицииВАренду</name>
  </enumValues>
  <enumValues>
    <name>ОбесценениеВНА</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненияВСтоимостиТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПереданнаяВозвратнаяТара</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныеСертификаты</name>
  </enumValues>
  <enumValues>
    <name>ПринятаяВозвратнаяТара</name>
  </enumValues>
  <enumValues>
    <name>ПроцентныеРасходыДисконтирования</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеАктивыПассивы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходыНезавершенногоПроизводства</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоФинансовымИнструментам</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКлиентами</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКлиентамиПоДокументам</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКлиентамиПоСрокам</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПоставщиками</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПоставщикамиПоДокументам</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПоставщикамиПоСрокам</name>
  </enumValues>
  <enumValues>
    <name>РезервыПоСомнительнымДолгам</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьТоваров</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьНМА</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьОС</name>
  </enumValues>
  <enumValues>
    <name>ТоварыКОформлениюОтчетовКомитенту</name>
  </enumValues>
  <enumValues>
    <name>ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках</name>
  </enumValues>
  <enumValues>
    <name>ТрудозатратыНезавершенногоПроизводства</name>
  </enumValues>
  <enumValues>
    <name>УслугиКОформлениюОтчетовПринципалу</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СпособыРасчетовСФизическимиЛицами/СпособыРасчетовСФизическимиЛицами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРасчетовСФизическимиЛицами</name>
  <enumValues>
    <name>ОплатаТруда</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчетыСПерсоналом</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКонтрагентами</name>
  </enumValues>
  <enumValues>
    <name>Дивиденды</name>
  </enumValues>
  <enumValues>
    <name>ДивидендыСотрудникам</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ОперацииКорректировкиРегистров/ОперацииКорректировкиРегистров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииКорректировкиРегистров</name>
  <enumValues>
    <name>РучнаяКорректировка</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеРазрывовОстатковВзаиморасчетов</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеРазвернутогоСальдоВзаиморасчетов</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/DataProcessors/тн_ПереносПереоценкиРасчетовССотрудникамиВУУ/Forms/Форма/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Период.ДатаНачала = НачалоМесяца(ТекущаяДатаСеанса());
	Объект.Период.ДатаОкончания = КонецМесяца(ТекущаяДатаСеанса());
	ПериодНаФорме = Объект.Период.ДатаНачала;
	МесяцСтрокой = ОбщегоНазначенияУТКлиентСервер.ПолучитьПредставлениеПериодаРегистрации(ПериодНаФорме);
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаСервере
Процедура ВыполнитьПереносПереоценкиНаСервере()

	УстановитьПривилегированныйРежим(Истина);
	МВТ = Новый МенеджерВременныхТаблиц;
	ПолучитьТаблицуПроводок(Объект.Период, Объект.Организация, МВТ);
	ДанныеЗаполнения = ФормированиеТаблицДвижений(МВТ);
	СуществующиеДвижения = ПолучениеДвиженийРегистровНакопления();
	ДозаполнитьТаблицыНалогами(ДанныеЗаполнения);
	ДозаполнитьТаблицыПодразделениями(ДанныеЗаполнения);
	СформироватьДанныеДляПроведения(ДанныеЗаполнения, СуществующиеДвижения);
	СформироватьДвижения(ДанныеЗаполнения);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПереносПереоценки(Команда)
	
	ВыполнитьПереносПереоценкиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область Данные

&НаСервере
Функция СчетаПереоценки()
	
	СчПереоценки = Новый Массив;
	
	// 69 счета
	СчПереоценки.Добавить(ПланыСчетов.Хозрасчетный.ФСС);
	СчПереоценки.Добавить(ПланыСчетов.Хозрасчетный.ПФР_страх);
	СчПереоценки.Добавить(ПланыСчетов.Хозрасчетный.ПФР_доп);
	СчПереоценки.Добавить(ПланыСчетов.Хозрасчетный.ПФР_ОПС);
	СчПереоценки.Добавить(ПланыСчетов.Хозрасчетный.ФФОМС);
	СчПереоценки.Добавить(ПланыСчетов.Хозрасчетный.ФСС_НСиПЗ);
	
	// 70
	СчПереоценки.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда);
	
	Возврат СчПереоценки;
	
КонецФункции

&НаСервере
Функция КорСчета()
	
	КС = Новый Массив;
	КС.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеДоходы);
	КС.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасходы);
	Возврат КС;
	
КонецФункции

&НаСервере
Функция СоответствиеСчетовИНалогов()
	
	СчетаИНалоги = Новый Соответствие;
	// НАЧАЛО Николаев Павел 08.11.2024 Выполнение задач №000051555
	//СчетаИНалоги.Вставить(ПланыСчетов.Хозрасчетный.ФСС, Перечисления.ТипыНалогов.ФСС);
	//СчетаИНалоги.Вставить(ПланыСчетов.Хозрасчетный.ПФР_страх, Перечисления.ТипыНалогов.ПФРСтраховаяЧасть);
	//СчетаИНалоги.Вставить(ПланыСчетов.Хозрасчетный.ПФР_доп,Перечисления.ТипыНалогов.ПФРДополнительныйТарифЛЭ);
	//СчетаИНалоги.Вставить(ПланыСчетов.Хозрасчетный.ПФР_ОПС,Перечисления.ТипыНалогов.ПФРСтраховаяЧасть); 
	//СчетаИНалоги.Вставить(ПланыСчетов.Хозрасчетный.ФФОМС, Перечисления.ТипыНалогов.ФФОМС);
	//СчетаИНалоги.Вставить(ПланыСчетов.Хозрасчетный.ФСС_НСиПЗ,Перечисления.ТипыНалогов.ФССНС);
	СчетаИНалоги.Вставить(ПланыСчетов.Хозрасчетный.ФСС, Справочники.ВидыНалоговВзносов.ФСС);
	СчетаИНалоги.Вставить(ПланыСчетов.Хозрасчетный.ПФР_страх, Справочники.ВидыНалоговВзносов.ПФРСтраховаяЧасть);
	СчетаИНалоги.Вставить(ПланыСчетов.Хозрасчетный.ПФР_доп,Справочники.ВидыНалоговВзносов.ПФРДополнительныйТарифЛЭ);
	СчетаИНалоги.Вставить(ПланыСчетов.Хозрасчетный.ПФР_ОПС,Справочники.ВидыНалоговВзносов.ПФРСтраховаяЧасть); 
	СчетаИНалоги.Вставить(ПланыСчетов.Хозрасчетный.ФФОМС, Справочники.ВидыНалоговВзносов.ФФОМС);
	СчетаИНалоги.Вставить(ПланыСчетов.Хозрасчетный.ФСС_НСиПЗ,Справочники.ВидыНалоговВзносов.ФССНС);
	// КОНЕЦ Николаев Павел 08.11.2024 Выполнение задач №000051555
	Возврат СчетаИНалоги;
	
КонецФункции

&НаСервере
Функция СоответствиеСчетовИВидовОперацииПоЗП()
	
	СчетаИНалоги = Новый Соответствие;
	СчетаИНалоги.Вставить(ПланыСчетов.Хозрасчетный.ФСС, Перечисления.ВидыОперацийПоЗарплате.ФСС);
	СчетаИНалоги.Вставить(ПланыСчетов.Хозрасчетный.ПФР_страх, Перечисления.ВидыОперацийПоЗарплате.ПФРСтраховаяЧасть);
	СчетаИНалоги.Вставить(ПланыСчетов.Хозрасчетный.ПФР_доп,Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифЛЭ);
	СчетаИНалоги.Вставить(ПланыСчетов.Хозрасчетный.ПФР_ОПС,Перечисления.ВидыОперацийПоЗарплате.ПФР);
	СчетаИНалоги.Вставить(ПланыСчетов.Хозрасчетный.ФФОМС, Перечисления.ВидыОперацийПоЗарплате.ФФОМС);
	СчетаИНалоги.Вставить(ПланыСчетов.Хозрасчетный.ФСС_НСиПЗ,Перечисления.ВидыОперацийПоЗарплате.ФССНС);
	Возврат СчетаИНалоги;    
	
КонецФункции

&НаСервере
Процедура ДозаполнитьТаблицыНалогами(ТаблицыДвижений) 
	
	Для Каждого ТаблицаДвижений Из ТаблицыДвижений Цикл
		Если ТаблицаДвижений.Ключ = "ПрочиеАктивыПассивы" Тогда
			Отбор = Новый Структура("Аналитика_", "Налог");
			МассивНайденныхСтрок = ТаблицаДвижений.Значение.НайтиСтроки(Отбор);
			ДозаполнитьНайденныеСтроки(МассивНайденныхСтрок,"Аналитика");
		ИначеЕсли ТаблицаДвижений.Ключ = "ДвиженияДоходыРасходыПрочиеАктивыПассивы" Тогда
			Отбор = Новый Структура("АналитикаАктивовПассивов_", "Налог");
			МассивНайденныхСтрок = ТаблицаДвижений.Значение.НайтиСтроки(Отбор);
			ДозаполнитьНайденныеСтроки(МассивНайденныхСтрок,"АналитикаАктивовПассивов");
			
			Отбор = Новый Структура("ВидОперацииПоЗарплате_", "ВидОперацииПоЗПНалог");
			МассивНайденныхСтрок = ТаблицаДвижений.Значение.НайтиСтроки(Отбор);
			ДозаполнитьНайденныеСтроки(МассивНайденныхСтрок,"ВидОперацииПоЗарплате");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры                                                                   

&НаСервере
Процедура ДозаполнитьНайденныеСтроки(МассивСтрок, ИмяКолонки)
	
	СоответствияНалогов = Новый Структура;
	СоответствияНалогов.Вставить("Аналитика",СоответствиеСчетовИНалогов());
	СоответствияНалогов.Вставить("АналитикаАктивовПассивов",СоответствиеСчетовИНалогов());
	СоответствияНалогов.Вставить("ВидОперацииПоЗарплате",СоответствиеСчетовИВидовОперацииПоЗП());
	Для Каждого СтрокаТЗ из МассивСтрок Цикл
		СтрокаТЗ[ИмяКолонки] = СоответствияНалогов[ИмяКолонки][СтрокаТЗ.СчетНалога];
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Процедура ДозаполнитьТаблицыПодразделениями(ТаблицыДвижений)

	Для Каждого ТаблицаДвижений Из ТаблицыДвижений Цикл
		Если ТаблицаДвижений.Ключ = "ПрочиеАктивыПассивы" Тогда
			Для Каждого СтрокаТЗ Из ТаблицаДвижений.Значение Цикл
				Если ТипЗнч(СтрокаТЗ.Аналитика)=Тип(Справочники.ФизическиеЛица) Тогда
					СтрокаТЗ.Подразделение = ПолучитьПодразделениеСотрудника(СтрокаТЗ.Аналитика, СтрокаТЗ.Период);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТаблицаДвижений.Ключ = "ДвиженияДоходыРасходыПрочиеАктивыПассивы" Тогда
			Для Каждого СтрокаТЗ Из ТаблицаДвижений.Значение Цикл
				Если ТипЗнч(СтрокаТЗ.АналитикаАктивовПассивов)=Тип(Справочники.ФизическиеЛица) Тогда
					СтрокаТЗ.Подразделение = ПолучитьПодразделениеСотрудника(СтрокаТЗ.АналитикаАктивовПассивов, СтрокаТЗ.Период);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьПодразделениеСотрудника(Физлицо, Дата)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТекущиеКадровыеДанныеСотрудников.ТекущееПодразделение КАК ТекущееПодразделение
	               |ИЗ
	               |	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	               |ГДЕ
	               |	ТекущиеКадровыеДанныеСотрудников.ДатаПриема >= &Дата
	               |	И ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения <= &Дата
	               |	И ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо = &ФизическоеЛицо";
	Запрос.УстановитьПараметр("ФизическоеЛицо", Физлицо); 
	Запрос.УстановитьПараметр("Дата", Дата);
	Выборка = Запрос.Выполнить().Выполнить();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Подразделение;
	КонецЦикла;                           
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ПолучитьТаблицуПроводок(Период, Организация, МВТ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетаПереоценки", СчетаПереоценки());
	Запрос.УстановитьПараметр("КорСчета", КорСчета());
	Запрос.УстановитьПараметр("Д_КурсовыеРазницы", ПланыВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы);
	Запрос.УстановитьПараметр("Р_КурсовыеРазницы", ПланыВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ХозрасчетныйДвиженияССубконто.Период КАК Период,
	               |	ХозрасчетныйДвиженияССубконто.Регистратор КАК Регистратор,
	               |	ХозрасчетныйДвиженияССубконто.Организация КАК Организация,
	               |	ХозрасчетныйДвиженияССубконто.СчетДт КАК СчетДт,
	               |	ХозрасчетныйДвиженияССубконто.СчетКт КАК СчетКт,
	               |	ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
	               |	ХозрасчетныйДвиженияССубконто.СубконтоДт2 КАК СубконтоДт2,
	               |	ХозрасчетныйДвиженияССубконто.СубконтоДт3 КАК СубконтоДт3,
	               |	ХозрасчетныйДвиженияССубконто.СубконтоКт1 КАК СубконтоКт1,
	               |	ХозрасчетныйДвиженияССубконто.СубконтоКт2 КАК СубконтоКт2,
	               |	ХозрасчетныйДвиженияССубконто.СубконтоКт3 КАК СубконтоКт3,
	               |	ХозрасчетныйДвиженияССубконто.ВалютаДт КАК ВалютаДт,
	               |	ХозрасчетныйДвиженияССубконто.ВалютаКт КАК ВалютаКт,
	               |	ХозрасчетныйДвиженияССубконто.ПодразделениеДт КАК ПодразделениеДт,
	               |	ХозрасчетныйДвиженияССубконто.ПодразделениеКт КАК ПодразделениеКт,
	               |	ХозрасчетныйДвиженияССубконто.НаправлениеДеятельностиДт КАК НаправлениеДеятельностиДт,
	               |	ХозрасчетныйДвиженияССубконто.НаправлениеДеятельностиКт КАК НаправлениеДеятельностиКт,
	               |	ХозрасчетныйДвиженияССубконто.Сумма КАК Сумма,
	               |	ХозрасчетныйДвиженияССубконто.Активность КАК Активность,
	               |	ХозрасчетныйДвиженияССубконто.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ВТ_ПроводкиБУ
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(&ДатаНачала, &ДатаКонца, Организация = &Организация, , ) КАК ХозрасчетныйДвиженияССубконто
	               |ГДЕ
	               |	ХозрасчетныйДвиженияССубконто.СубконтоКт1 = &Д_КурсовыеРазницы
	               |	И ХозрасчетныйДвиженияССубконто.СчетДт В(&СчетаПереоценки)
	               |	И ХозрасчетныйДвиженияССубконто.СчетКт В(&КорСчета)
	               |	И ХозрасчетныйДвиженияССубконто.Активность
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ХозрасчетныйДвиженияССубконто.Период,
	               |	ХозрасчетныйДвиженияССубконто.Регистратор,
	               |	ХозрасчетныйДвиженияССубконто.Организация,
	               |	ХозрасчетныйДвиженияССубконто.СчетДт,
	               |	ХозрасчетныйДвиженияССубконто.СчетКт,
	               |	ХозрасчетныйДвиженияССубконто.СубконтоДт1,
	               |	ХозрасчетныйДвиженияССубконто.СубконтоДт2,
	               |	ХозрасчетныйДвиженияССубконто.СубконтоДт3,
	               |	ХозрасчетныйДвиженияССубконто.СубконтоКт1,
	               |	ХозрасчетныйДвиженияССубконто.СубконтоКт2,
	               |	ХозрасчетныйДвиженияССубконто.СубконтоКт3,
	               |	ХозрасчетныйДвиженияССубконто.ВалютаДт,
	               |	ХозрасчетныйДвиженияССубконто.ВалютаКт,
	               |	ХозрасчетныйДвиженияССубконто.ПодразделениеДт,
	               |	ХозрасчетныйДвиженияССубконто.ПодразделениеКт,
	               |	ХозрасчетныйДвиженияССубконто.НаправлениеДеятельностиДт,
	               |	ХозрасчетныйДвиженияССубконто.НаправлениеДеятельностиКт,
	               |	ХозрасчетныйДвиженияССубконто.Сумма,
	               |	ХозрасчетныйДвиженияССубконто.Активность,
	               |	ХозрасчетныйДвиженияССубконто.НомерСтроки
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(&ДатаНачала, &ДатаКонца, Организация = &Организация, , ) КАК ХозрасчетныйДвиженияССубконто
	               |ГДЕ
	               |	ХозрасчетныйДвиженияССубконто.СубконтоДт1 = &Р_КурсовыеРазницы
	               |	И ХозрасчетныйДвиженияССубконто.СчетДт В(&КорСчета)
	               |	И ХозрасчетныйДвиженияССубконто.СчетКт В(&СчетаПереоценки)
	               |	И ХозрасчетныйДвиженияССубконто.Активность";
	Запрос.Выполнить();
	
КонецПроцедуры

&НаСервере
Функция ФормированиеТаблицДвижений(МенВремТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенВремТаблиц;
	Запрос.УстановитьПараметр("КорСчета", КорСчета());
	Запрос.УстановитьПараметр("СчетаПереоценки", СчетаПереоценки());
	Запрос.УстановитьПараметр("СтатьяДоходыТекущегоПериода", ПланыВидовХарактеристик.СтатьиАктивовПассивов.ДоходыТекущегоПериода);
	Запрос.УстановитьПараметр("СтатьяРасходыТекущегоПериода", ПланыВидовХарактеристик.СтатьиАктивовПассивов.РасходыТекущегоПериода);
	Запрос.УстановитьПараметр("СтатьяОплатаТруда", ПланыВидовХарактеристик.СтатьиАктивовПассивов.ОплатаТруда);
	Запрос.УстановитьПараметр("СтатьяНалоги", ПланыВидовХарактеристик.СтатьиАктивовПассивов.Налоги);
	Запрос.УстановитьПараметр("ПрочиеРасходы", Перечисления.ИсточникиУправленческогоБаланса.ПрочиеРасходы);
	Запрос.УстановитьПараметр("ПрочиеДоходы", Перечисления.ИсточникиУправленческогоБаланса.ПрочиеДоходы);
	Запрос.УстановитьПараметр("Налоги", ПланыВидовХарактеристик.СтатьиАктивовПассивов.Налоги); 
	Запрос.УстановитьПараметр("Приход", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Расход", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Начислено", Перечисления.ВидыОперацийПоЗарплате.НачисленоДоход);
	Запрос.УстановитьПараметр("СпособРасчетов", Перечисления.СпособыРасчетовСФизическимиЛицами.ОплатаТруда);
	Запрос.УстановитьПараметр("РасчетCебестоимостиИЗатрат", Перечисления.ВидыИсточниковДвижений.РасчетСебестоимости);
	Запрос.УстановитьПараметр("ОтражениеКурсовыхРазниц", Перечисления.ХозяйственныеОперации.тн_ОтражениеКурсовыхРазницПоРасчетамСПерсоналом);
	Запрос.Текст = "ВЫБРАТЬ
	               |	""ПрочиеРасходы"" КАК ИмяРегистра,
	               |	ПроводкиБУ.Период КАК Период,
	               |	&Приход КАК ВидДвижения,
	               |	ПроводкиБУ.Организация КАК Организация,
	               |	ПроводкиБУ.ПодразделениеДт КАК Подразделение,
	               |	ПроводкиБУ.НаправлениеДеятельностиДт КАК НаправлениеДеятельности,
	               |	ПроводкиБУ.СубконтоДт1 КАК СтатьяРасходов,
	               |	NULL КАК АналитикаРасходов,
	               |	ПроводкиБУ.Сумма КАК Сумма,
	               |	ПроводкиБУ.Сумма КАК СуммаРегл,
	               |	ПроводкиБУ.Сумма КАК СуммаУпр,
	               |	&ОтражениеКурсовыхРазниц КАК ХозяйственнаяОперация,
	               |	ЛОЖЬ КАК РасчетСебестоимости,
	               |	ЛОЖЬ КАК РасчетПартий,
	               |	ПроводкиБУ.Активность КАК Активность,
	               |	ПроводкиБУ.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ТаблицаПрочиеРасходы
	               |ИЗ
	               |	ВТ_ПроводкиБУ КАК ПроводкиБУ
	               |ГДЕ
	               |	ПроводкиБУ.СчетДт В(&КорСчета)
	               |	И ПроводкиБУ.СчетКт В(&СчетаПереоценки)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	""ПрочиеДоходы"" КАК ИмяРегистра,
	               |	ПроводкиБУ.Период КАК Период,
	               |	&Приход КАК ВидДвижения,
	               |	ПроводкиБУ.Организация КАК Организация,
	               |	ПроводкиБУ.ПодразделениеКт КАК Подразделение,
	               |	ПроводкиБУ.НаправлениеДеятельностиКт КАК НаправлениеДеятельности,
	               |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КАК СтатьяДоходов,
	               |	NULL КАК АналитикаДоходов,
	               |	ПроводкиБУ.Сумма КАК Сумма,
	               |	ПроводкиБУ.Сумма КАК СуммаУпр,
	               |	ПроводкиБУ.Сумма КАК СуммаРегл,
	               |	&ОтражениеКурсовыхРазниц КАК ХозяйственнаяОперация,
	               |	ЛОЖЬ КАК РасчетСебестоимости,
	               |	ПроводкиБУ.Активность КАК Активность,
	               |	ПроводкиБУ.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ТаблицаПрочиеДоходы
	               |ИЗ
	               |	ВТ_ПроводкиБУ КАК ПроводкиБУ
	               |ГДЕ
	               |	ПроводкиБУ.СчетКт В(&КорСчета)
	               |	И ПроводкиБУ.СчетДт В(&СчетаПереоценки)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	""ПрочиеАктивыПассивы"" КАК ИмяРегистра,
	               |	&Приход КАК ВидДвижения,
	               |	ПроводкиБУ.Период КАК Период,
	               |	ПроводкиБУ.Организация КАК Организация,
	               |	ПроводкиБУ.ПодразделениеДт КАК Подразделение,
	               |	ПроводкиБУ.НаправлениеДеятельностиДт КАК НаправлениеДеятельности,
	               |	&СтатьяРасходыТекущегоПериода КАК Статья,
	               |	NULL КАК Аналитика,
	               |	ПроводкиБУ.Сумма КАК Сумма,
	               |	ЛОЖЬ КАК РасчетСебестоимости,
	               |	&РасчетCебестоимостиИЗатрат КАК ВидИсточника,
	               |	&ПрочиеРасходы КАК Источник,
	               |	NULL КАК СчетНалога,
	               |	ПроводкиБУ.Активность КАК Активность,
	               |	NULL КАК Аналитика_,
	               |	ПроводкиБУ.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ПрочиеАктивыПассивы
	               |ИЗ
	               |	ВТ_ПроводкиБУ КАК ПроводкиБУ
	               |ГДЕ
	               |	ПроводкиБУ.СчетДт В(&КорСчета)
	               |	И ПроводкиБУ.СчетКт В(&СчетаПереоценки)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""ПрочиеАктивыПассивы"",
	               |	&Расход,
	               |	ПроводкиБУ.Период,
	               |	ПроводкиБУ.Организация,
	               |	ПроводкиБУ.ПодразделениеКт,
	               |	ПроводкиБУ.НаправлениеДеятельностиКт,
	               |	ВЫБОР
	               |		КОГДА ПроводкиБУ.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |			ТОГДА &СтатьяОплатаТруда
	               |		ИНАЧЕ &СтатьяНалоги
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ПроводкиБУ.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |			ТОГДА ПроводкиБУ.СубконтоКт1
				   // НАЧАЛО Николаев Павел 08.11.2024 Выполнение задач №000051555
	               //|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПустаяСсылка)
				   |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыНалоговВзносов.ПустаяСсылка)
				   // КОНЕЦ Николаев Павел 08.11.2024 Выполнение задач №000051555
	               |	КОНЕЦ,
	               |	ПроводкиБУ.Сумма,
	               |	ЛОЖЬ,
	               |	NULL,
	               |	NULL,
	               |	ВЫБОР
	               |		КОГДА ПроводкиБУ.СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |			ТОГДА ПроводкиБУ.СчетКт
	               |	КОНЕЦ,
	               |	ПроводкиБУ.Активность,
	               |	ВЫБОР
	               |		КОГДА ПроводкиБУ.СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |			ТОГДА ""Налог""
	               |	КОНЕЦ,
	               |	ПроводкиБУ.НомерСтроки
	               |ИЗ
	               |	ВТ_ПроводкиБУ КАК ПроводкиБУ
	               |ГДЕ
	               |	ПроводкиБУ.СчетДт В(&КорСчета)
	               |	И ПроводкиБУ.СчетКт В(&СчетаПереоценки)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""ПрочиеАктивыПассивы"",
	               |	&Расход,
	               |	ПроводкиБУ.Период,
	               |	ПроводкиБУ.Организация,
	               |	ПроводкиБУ.ПодразделениеКт,
	               |	ПроводкиБУ.НаправлениеДеятельностиКт,
	               |	&СтатьяДоходыТекущегоПериода,
	               |	NULL,
	               |	ПроводкиБУ.Сумма,
	               |	ЛОЖЬ,
	               |	&РасчетCебестоимостиИЗатрат,
	               |	&ПрочиеДоходы,
	               |	NULL,
	               |	ПроводкиБУ.Активность,
	               |	NULL,
	               |	ПроводкиБУ.НомерСтроки
	               |ИЗ
	               |	ВТ_ПроводкиБУ КАК ПроводкиБУ
	               |ГДЕ
	               |	ПроводкиБУ.СчетДт В(&СчетаПереоценки)
	               |	И ПроводкиБУ.СчетКт В(&КорСчета)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""ПрочиеАктивыПассивы"",
	               |	&Приход,
	               |	ПроводкиБУ.Период,
	               |	ПроводкиБУ.Организация,
	               |	ПроводкиБУ.ПодразделениеДт,
	               |	ПроводкиБУ.НаправлениеДеятельностиДт,
	               |	ВЫБОР
	               |		КОГДА ПроводкиБУ.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |			ТОГДА &СтатьяОплатаТруда
	               |		ИНАЧЕ &СтатьяНалоги
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ПроводкиБУ.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |			ТОГДА ПроводкиБУ.СубконтоДт1
				   // НАЧАЛО Николаев Павел 08.11.2024 Выполнение задач №000051555
	               //|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПустаяСсылка)
				   |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыНалоговВзносов.ПустаяСсылка)
				   // КОНЕЦ Николаев Павел 08.11.2024 Выполнение задач №000051555
	               |	КОНЕЦ,
	               |	ПроводкиБУ.Сумма,
	               |	ЛОЖЬ,
	               |	NULL,
	               |	NULL,
	               |	ВЫБОР
	               |		КОГДА ПроводкиБУ.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |			ТОГДА ПроводкиБУ.СчетДт
	               |	КОНЕЦ,
	               |	ПроводкиБУ.Активность,
	               |	ВЫБОР
	               |		КОГДА ПроводкиБУ.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |			ТОГДА ""Налог""
	               |	КОНЕЦ,
	               |	ПроводкиБУ.НомерСтроки
	               |ИЗ
	               |	ВТ_ПроводкиБУ КАК ПроводкиБУ
	               |ГДЕ
	               |	ПроводкиБУ.СчетДт В(&СчетаПереоценки)
	               |	И ПроводкиБУ.СчетКт В(&КорСчета)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	""ДвиженияДоходыРасходыПрочиеАктивыПассивы"" КАК ИмяРегистра,
	               |	ПроводкиБУ.Период КАК Период,
	               |	ПроводкиБУ.Организация КАК Организация,
	               |	&ОтражениеКурсовыхРазниц КАК ХозяйственнаяОперация,
	               |	ПроводкиБУ.ПодразделениеКт КАК Подразделение,
	               |	ПроводкиБУ.НаправлениеДеятельностиКт КАК НаправлениеДеятельности,
	               |	ВЫБОР
	               |		КОГДА ПроводкиБУ.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |			ТОГДА &СтатьяОплатаТруда
	               |		КОГДА ПроводкиБУ.СчетКт В (&СчетаПереоценки)
	               |				И ПроводкиБУ.СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |			ТОГДА &СтатьяНалоги
	               |	КОНЕЦ КАК Статья,
	               |	NULL КАК СтатьяДоходов,
	               |	NULL КАК АналитикаРасходов,
	               |	ВЫБОР
	               |		КОГДА ПроводкиБУ.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |			ТОГДА ПроводкиБУ.СубконтоКт1
				   // НАЧАЛО Николаев Павел 08.11.2024 Выполнение задач №000051555
	               //|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПустаяСсылка)
				   |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыНалоговВзносов.ПустаяСсылка)
				   // КОНЕЦ Николаев Павел 08.11.2024 Выполнение задач №000051555
	               |	КОНЕЦ КАК АналитикаАктивовПассивов,
	               |	ПроводкиБУ.ПодразделениеДт КАК КорПодразделение,
	               |	ПроводкиБУ.СубконтоДт1 КАК КорСтатья,
	               |	NULL КАК КорАналитикаРасходов,
	               |	ПроводкиБУ.Сумма КАК СуммаСНДСУпр,
	               |	ПроводкиБУ.Сумма КАК СуммаБезНДСРегл,
	               |	ПроводкиБУ.Сумма КАК СуммаБезНДСУпр,
	               |	ВЫБОР
	               |		КОГДА ПроводкиБУ.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |			ТОГДА &Начислено
	               |	КОНЕЦ КАК ВидОперацииПоЗарплате,
	               |	&СпособРасчетов КАК СпособРасчетов,
	               |	ЛОЖЬ КАК НеОблагаетсяНДФЛ,
	               |	ПроводкиБУ.Активность КАК Активность,
	               |	ВЫБОР
	               |		КОГДА ПроводкиБУ.СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |				И ПроводкиБУ.СчетКт В (&СчетаПереоценки)
	               |			ТОГДА ПроводкиБУ.СчетКт
	               |	КОНЕЦ КАК СчетНалога,
	               |	ВЫБОР
	               |		КОГДА ПроводкиБУ.СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |				И ПроводкиБУ.СчетКт В (&СчетаПереоценки)
	               |			ТОГДА ""Налог""
	               |	КОНЕЦ КАК АналитикаАктивовПассивов_,
	               |	ВЫБОР
	               |		КОГДА ПроводкиБУ.СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |				И ПроводкиБУ.СчетКт В (&СчетаПереоценки)
	               |			ТОГДА ""ВидОперацииПоЗПНалог""
	               |	КОНЕЦ КАК ВидОперацииПоЗарплате_,
	               |	ПроводкиБУ.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ДвиженияДоходыРасходыПрочиеАктивыПассивы
	               |ИЗ
	               |	ВТ_ПроводкиБУ КАК ПроводкиБУ
	               |ГДЕ
	               |	ПроводкиБУ.СчетКт В(&СчетаПереоценки)
	               |	И ПроводкиБУ.СчетДт В(&КорСчета)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""ДвиженияДоходыРасходыПрочиеАктивыПассивы"",
	               |	ПроводкиБУ.Период,
	               |	ПроводкиБУ.Организация,
	               |	&ОтражениеКурсовыхРазниц,
	               |	ПроводкиБУ.ПодразделениеДт,
	               |	ПроводкиБУ.НаправлениеДеятельностиДт,
	               |	ВЫБОР
	               |		КОГДА ПроводкиБУ.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |			ТОГДА &СтатьяОплатаТруда
	               |		КОГДА ПроводкиБУ.СчетДт В (&СчетаПереоценки)
	               |				И ПроводкиБУ.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |			ТОГДА &СтатьяНалоги
	               |	КОНЕЦ,
	               |	NULL,
	               |	NULL,
	               |	ВЫБОР
	               |		КОГДА ПроводкиБУ.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |			ТОГДА ПроводкиБУ.СубконтоДт1
				   // НАЧАЛО Николаев Павел 08.11.2024 Выполнение задач №000051555
	               //|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПустаяСсылка)
				   |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыНалоговВзносов.ПустаяСсылка)
				   // КОНЕЦ Николаев Павел 08.11.2024 Выполнение задач №000051555
	               |	КОНЕЦ,
	               |	ПроводкиБУ.ПодразделениеКт,
	               |	ПроводкиБУ.СубконтоКт1,
	               |	NULL,
	               |	ПроводкиБУ.Сумма,
	               |	ПроводкиБУ.Сумма,
	               |	ПроводкиБУ.Сумма,
	               |	ВЫБОР
	               |		КОГДА ПроводкиБУ.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |			ТОГДА &Начислено
	               |	КОНЕЦ,
	               |	&СпособРасчетов,
	               |	ЛОЖЬ,
	               |	ПроводкиБУ.Активность,
	               |	ВЫБОР
	               |		КОГДА ПроводкиБУ.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |				И ПроводкиБУ.СчетДт В (&СчетаПереоценки)
	               |			ТОГДА ПроводкиБУ.СчетДт
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ПроводкиБУ.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |				И ПроводкиБУ.СчетДт В (&СчетаПереоценки)
	               |			ТОГДА ""Налог""
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ПроводкиБУ.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	               |				И ПроводкиБУ.СчетДт В (&СчетаПереоценки)
	               |			ТОГДА ""ВидОперацииПоЗПНалог""
	               |	КОНЕЦ,
	               |	ПроводкиБУ.НомерСтроки
	               |ИЗ
	               |	ВТ_ПроводкиБУ КАК ПроводкиБУ
	               |ГДЕ
	               |	ПроводкиБУ.СчетДт В(&СчетаПереоценки)
	               |	И ПроводкиБУ.СчетКт В(&КорСчета)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПрочиеРасходы.ИмяРегистра КАК ИмяРегистра,
	               |	ТаблицаПрочиеРасходы.Период КАК Период,
	               |	ТаблицаПрочиеРасходы.ВидДвижения КАК ВидДвижения,
	               |	ТаблицаПрочиеРасходы.Организация КАК Организация,
	               |	ТаблицаПрочиеРасходы.Подразделение КАК Подразделение,
	               |	ТаблицаПрочиеРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	               |	ТаблицаПрочиеРасходы.СтатьяРасходов КАК СтатьяРасходов,
	               |	ТаблицаПрочиеРасходы.АналитикаРасходов КАК АналитикаРасходов,
	               |	ТаблицаПрочиеРасходы.Сумма КАК Сумма,
	               |	ТаблицаПрочиеРасходы.Сумма КАК СуммаБезНДС,
	               |	ТаблицаПрочиеРасходы.СуммаРегл КАК СуммаРегл,
	               |	ТаблицаПрочиеРасходы.СуммаУпр КАК СуммаУпр,
	               |	ТаблицаПрочиеРасходы.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	               |	ТаблицаПрочиеРасходы.РасчетСебестоимости КАК РасчетСебестоимости,
	               |	ТаблицаПрочиеРасходы.РасчетПартий КАК РасчетПартий,
	               |	ТаблицаПрочиеРасходы.Активность КАК Активность,
	               |	ТаблицаПрочиеРасходы.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	ТаблицаПрочиеРасходы КАК ТаблицаПрочиеРасходы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПрочиеДоходы.ИмяРегистра КАК ИмяРегистра,
	               |	ТаблицаПрочиеДоходы.Период КАК Период,
	               |	ТаблицаПрочиеДоходы.ВидДвижения КАК ВидДвижения,
	               |	ТаблицаПрочиеДоходы.Организация КАК Организация,
	               |	ТаблицаПрочиеДоходы.Подразделение КАК Подразделение,
	               |	ТаблицаПрочиеДоходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	               |	ТаблицаПрочиеДоходы.СтатьяДоходов КАК СтатьяДоходов,
	               |	ТаблицаПрочиеДоходы.АналитикаДоходов КАК АналитикаДоходов,
	               |	ТаблицаПрочиеДоходы.Сумма КАК Сумма,
	               |	ТаблицаПрочиеДоходы.СуммаРегл КАК СуммаРегл,
	               |	ТаблицаПрочиеДоходы.Сумма КАК СуммаУпр,
	               |	ТаблицаПрочиеДоходы.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	               |	ТаблицаПрочиеДоходы.РасчетСебестоимости КАК РасчетСебестоимости,
	               |	ТаблицаПрочиеДоходы.Активность КАК Активность,
	               |	ТаблицаПрочиеДоходы.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	ТаблицаПрочиеДоходы КАК ТаблицаПрочиеДоходы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПрочиеАктивыПассивы.ИмяРегистра КАК ИмяРегистра,
	               |	ПрочиеАктивыПассивы.ВидДвижения КАК ВидДвижения,
	               |	ПрочиеАктивыПассивы.Период КАК Период,
	               |	ПрочиеАктивыПассивы.Организация КАК Организация,
	               |	ПрочиеАктивыПассивы.Подразделение КАК Подразделение,
	               |	ПрочиеАктивыПассивы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	               |	ПрочиеАктивыПассивы.Статья КАК Статья,
	               |	ПрочиеАктивыПассивы.Аналитика КАК Аналитика,
	               |	ПрочиеАктивыПассивы.Сумма КАК Сумма,
	               |	ПрочиеАктивыПассивы.РасчетСебестоимости КАК РасчетСебестоимости,
	               |	ПрочиеАктивыПассивы.ВидИсточника КАК ВидИсточника,
	               |	ПрочиеАктивыПассивы.Источник КАК Источник,
	               |	ПрочиеАктивыПассивы.Активность КАК Активность,
	               |	ПрочиеАктивыПассивы.СчетНалога КАК СчетНалога,
	               |	ПрочиеАктивыПассивы.Аналитика_ КАК Аналитика_,
	               |	ПрочиеАктивыПассивы.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	ПрочиеАктивыПассивы КАК ПрочиеАктивыПассивы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.ИмяРегистра КАК ИмяРегистра,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.Период КАК Период,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.Организация КАК Организация,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.Подразделение КАК Подразделение,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.Статья КАК Статья,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.АналитикаРасходов КАК АналитикаРасходов,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.КорПодразделение КАК КорПодразделение,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.КорСтатья КАК КорСтатья,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.КорАналитикаРасходов КАК КорАналитикаРасходов,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.СуммаСНДСУпр КАК Сумма,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.СуммаБезНДСРегл КАК СуммаРегл,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.СуммаБезНДСУпр КАК СуммаУпр,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.ВидОперацииПоЗарплате КАК ВидОперацииПоЗарплате,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.СпособРасчетов КАК СпособРасчетов,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.Активность КАК Активность,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.СчетНалога КАК СчетНалога,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.АналитикаАктивовПассивов_ КАК АналитикаАктивовПассивов_,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.ВидОперацииПоЗарплате_ КАК ВидОперацииПоЗарплате_,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.НомерСтроки КАК НомерСтроки,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.НеОблагаетсяНДФЛ КАК НеОблагаетсяНДФЛ
	               |ИЗ
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы КАК ДвиженияДоходыРасходыПрочиеАктивыПассивы";   
	
	Результат = Запрос.ВыполнитьПакет();
	ДвиженияПоРегистрам = Новый Структура; 
	ДвиженияПоРегистрам.Вставить("ПрочиеРасходы",Результат[4].Выгрузить());
	ДвиженияПоРегистрам.Вставить("ПрочиеДоходы",Результат[5].Выгрузить());
	ДвиженияПоРегистрам.Вставить("ПрочиеАктивыПассивы",Результат[6].Выгрузить());
	ДвиженияПоРегистрам.Вставить("ДвиженияДоходыРасходыПрочиеАктивыПассивы", Результат[7].Выгрузить());
	Возврат ДвиженияПоРегистрам;
	
КонецФункции

&НаСервере
Функция ПолучениеДвиженийРегистровНакопления()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", Объект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца", Объект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ПереносПереоценки", Перечисления.ХозяйственныеОперации.тн_ОтражениеКурсовыхРазницПоРасчетамСПерсоналом);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПрочиеДоходы.Период КАК Период,
	               |	ПрочиеДоходы.Активность КАК Активность,
	               |	ПрочиеДоходы.ВидДвижения КАК ВидДвижения,
	               |	ПрочиеДоходы.Организация КАК Организация,
	               |	ПрочиеДоходы.Подразделение КАК Подразделение,
	               |	ПрочиеДоходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	               |	ПрочиеДоходы.АналитикаДоходов КАК АналитикаДоходов,
	               |	ПрочиеДоходы.Сумма КАК Сумма,
	               |	ПрочиеДоходы.РасчетСебестоимости КАК РасчетСебестоимости
	               |ИЗ
	               |	РегистрНакопления.ПрочиеДоходы КАК ПрочиеДоходы
	               |ГДЕ
	               |	ПрочиеДоходы.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	               |	И ПрочиеДоходы.Период >= &ДатаНачала
	               |	И ПрочиеДоходы.Период <= &ДатаКонца
	               |	И ПрочиеДоходы.ХозяйственнаяОперация = &ПереносПереоценки
	               |	И ПрочиеДоходы.Активность
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПрочиеРасходы.Период КАК Период,
	               |	ПрочиеРасходы.Активность КАК Активность,
	               |	ПрочиеРасходы.ВидДвижения КАК ВидДвижения,
	               |	ПрочиеРасходы.Организация КАК Организация,
	               |	ПрочиеРасходы.Подразделение КАК Подразделение,
	               |	ПрочиеРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	               |	ПрочиеРасходы.СтатьяРасходов КАК СтатьяРасходов,
	               |	ПрочиеРасходы.АналитикаРасходов КАК АналитикаРасходов,
	               |	ПрочиеРасходы.Сумма КАК Сумма,
	               |	ПрочиеРасходы.РасчетСебестоимости КАК РасчетСебестоимости
	               |ИЗ
	               |	РегистрНакопления.ПрочиеРасходы КАК ПрочиеРасходы
	               |ГДЕ
	               |	ПрочиеРасходы.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	               |	И ПрочиеРасходы.Период >= &ДатаНачала
	               |	И ПрочиеРасходы.Период <= &ДатаКонца
	               |	И ПрочиеРасходы.ХозяйственнаяОперация = &ПереносПереоценки
	               |	И ПрочиеРасходы.Активность
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПрочиеАктивыПассивы.Активность КАК Активность,
	               |	ПрочиеАктивыПассивы.ВидДвижения КАК ВидДвижения,
	               |	ПрочиеАктивыПассивы.Период КАК Период,
	               |	ПрочиеАктивыПассивы.Организация КАК Организация,
	               |	ПрочиеАктивыПассивы.Подразделение КАК Подразделение,
	               |	ПрочиеАктивыПассивы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	               |	ПрочиеАктивыПассивы.Статья КАК Статья,
	               |	ПрочиеАктивыПассивы.Аналитика КАК Аналитика,
	               |	ПрочиеАктивыПассивы.Сумма КАК Сумма,
	               |	ПрочиеАктивыПассивы.РасчетСебестоимости КАК РасчетСебестоимости,
	               |	ПрочиеАктивыПассивы.ВидИсточника КАК ВидИсточника,
	               |	ПрочиеАктивыПассивы.Источник КАК Источник
	               |ИЗ
	               |	РегистрНакопления.ПрочиеАктивыПассивы КАК ПрочиеАктивыПассивы
	               |ГДЕ
	               |	ПрочиеАктивыПассивы.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	               |	И ПрочиеАктивыПассивы.Период >= &ДатаНачала
	               |	И ПрочиеАктивыПассивы.Период <= &ДатаКонца
	               |	И ПрочиеАктивыПассивы.Активность
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.Активность КАК Активность,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.Период КАК Период,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.Организация КАК Организация,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.Подразделение КАК Подразделение,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.Статья КАК Статья,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.АналитикаРасходов КАК АналитикаРасходов,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.КорПодразделение КАК КорПодразделение,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.КорСтатья КАК КорСтатья,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.КорАналитикаРасходов КАК КорАналитикаРасходов,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.Сумма КАК Сумма,
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.СпособРасчетов КАК СпособРасчетов
	               |ИЗ
	               |	РегистрНакопления.ДвиженияДоходыРасходыПрочиеАктивыПассивы КАК ДвиженияДоходыРасходыПрочиеАктивыПассивы
	               |ГДЕ
	               |	ДвиженияДоходыРасходыПрочиеАктивыПассивы.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	               |	И ДвиженияДоходыРасходыПрочиеАктивыПассивы.Период >= &ДатаНачала
	               |	И ДвиженияДоходыРасходыПрочиеАктивыПассивы.Период <= &ДатаКонца
	               |	И ДвиженияДоходыРасходыПрочиеАктивыПассивы.ХозяйственнаяОперация = &ПереносПереоценки
	               |	И ДвиженияДоходыРасходыПрочиеАктивыПассивы.Активность";
	Результат = Запрос.ВыполнитьПакет();
	СуществующиеДвижения = Новый Структура;
	СуществующиеДвижения.Вставить("ПрочиеДоходы", Результат[0].Выгрузить());
	СуществующиеДвижения.Вставить("ПрочиеРасходы", Результат[1].Выгрузить());
	СуществующиеДвижения.Вставить("ПрочиеАктивыПассивы", Результат[2].Выгрузить());
	СуществующиеДвижения.Вставить("ДвиженияДоходыРасходыПрочиеАктивыПассивы", Результат[3].Выгрузить()); 
	
	Возврат СуществующиеДвижения;
	
КонецФункции

&НаСервере
Процедура СформироватьДанныеДляПроведения(ИсходныеДанные, ДанныеДляУдаления)
	
	Для Каждого ЭлементКоллекции из ДанныеДляУдаления Цикл
		
		ИмяТаблицы = ЭлементКоллекции.Ключ;
		ТаблицаИсходныхДанных = ИсходныеДанные[ИмяТаблицы];
		ТаблицаУдаления = ЭлементКоллекции.Значение;
		Для Каждого СтрокаПоиска Из ТаблицаУдаления Цикл
			
			ПараметрыПоиска = Новый Структура;
			Для КолонкаТЗ=0 По ТаблицаУдаления.Колонки.Количество()-1 Цикл
				ИмяПоля = ТаблицаУдаления.Колонки[КолонкаТЗ].Имя;
				ЗначениеПоля = СтрокаПоиска[КолонкаТЗ];
				Если ИмяПоля<>"НомерСтроки" Или ИмяПоля<>"ХозяйственнаяОперация" Или ИмяПоля<>"ИмяРегистра" 
				Или Прав(ИмяПоля,1)<>"_" Тогда
					Если ЗначениеЗаполнено(ЗначениеПоля) Тогда
						ПараметрыПоиска.Вставить(ИмяПоля, ЗначениеПоля);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла; 
			
			Если ТаблицаИсходныхДанных.Количество()>0 Тогда
				мИскомыеСтроки = ТаблицаИсходныхДанных.НайтиСтроки(ПараметрыПоиска);
				Если мИскомыеСтроки.Количество()>0  Тогда       
					Для Каждого НайденнаяСтрока из мИскомыеСтроки Цикл
						ТаблицаИсходныхДанных.Удалить(НайденнаяСтрока);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Движения

&НаСервере
Процедура СформироватьДвижения(ТаблицыДвижений)
	
	ФормироватьДвижения = Ложь;
	РегистрыДокументаОснования = Новый ТаблицаЗначений;
	РегистрыДокументаОснования.Колонки.Добавить("Имя");
	Для Каждого ТД Из ТаблицыДвижений Цикл
		ЕстьПроводки = ТД.Значение.Количество()>0;
		Если ЕстьПроводки Тогда
			НовСтрРегистры = РегистрыДокументаОснования.Добавить();
			НовСтрРегистры.Имя = ТД.Ключ;
		КонецЕсли;
		ФормироватьДвижения = ФормироватьДвижения Или ЕстьПроводки;
	КонецЦикла;
	
	Если ФормироватьДвижения Тогда
		Попытка
			НачатьТранзакцию();
			НовДок = Документы.КорректировкаРегистров.СоздатьДокумент();
			НовДок.Организация = Объект.Организация;
			НовДок.Ответственный = Объект.Ответственный;
			НовДок.Дата = Объект.Период.ДатаОкончания;
			НовДок.ТаблицаРегистров.Загрузить(РегистрыДокументаОснования);
			НовДок.Операция = Перечисления.ОперацииКорректировкиРегистров.РучнаяКорректировка;    
			НовДок.Комментарий = "#Отражение курсовых разниц по расчетам с персоналом за "+МесяцСтрокой;
			Для Каждого Табл из ТаблицыДвижений Цикл
				ИмяРегистра = Табл.Ключ; 
				ТаблицаДвижений = Табл.Значение;  
				ДвиженияРегистра = НовДок.Движения[ИмяРегистра];
				ДвиженияРегистра.Записывать = Истина;
				Для Каждого ДанныеДвижения Из ТаблицаДвижений Цикл 
					НовДвижение = ДвиженияРегистра.Добавить();
					ЗаполнитьЗначенияСвойств(НовДвижение, ДанныеДвижения);
				КонецЦикла;
			КонецЦикла; 
			НовДок.Записать();
			ЗафиксироватьТранзакцию();               
			СообщШаблон = НСтр("ru='Выполнен перенос проводок c %1 по %2. Создан документ %3'");
			Сообщение = СтрШаблон(СообщШаблон, Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания, НовДок.Ссылка); 
			ОбщегоНазначения.СообщитьПользователю(Сообщение);
		Исключение
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			СообщШаблон = НСтр("ru='Ошибка переноса. Документ и движения по регистрам не сформированы по причине: %1'");
			Сообщение = СтрШаблон(СообщШаблон, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(Сообщение);
		КонецПопытки;                 
	Иначе
		СообщШаблон = НСтр("ru='В периоде %1  нет проводок для переноса'");
		Сообщение = СтрШаблон(СообщШаблон, МесяцСтрокой); 
		ОбщегоНазначения.СообщитьПользователю(Сообщение);
	КонецЕсли;
	
КонецПроцедуры    

#КонецОбласти

#Область Период

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбработчикЗакрытия = Новый ОписаниеОповещения("ПредставлениеПериодаРегистрацииНачалоВыбораЗавершение", ЭтотОбъект);
	ПараметрыФормы 	   = Новый Структура("Значение, РежимВыбораПериода", ПериодНаФорме, "МЕСЯЦ");
	
	ОткрытьФорму("ОбщаяФорма.ВыборПериода",
		ПараметрыФормы, 
		ЭтотОбъект, 
		УникальныйИдентификатор,
		,
		, 
		ОбработчикЗакрытия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ОбщегоНазначенияУТКлиент.РегулированиеПредставленияПериодаРегистрации(
		Направление,
		СтандартнаяОбработка,
		ПериодНаФорме,
		МесяцСтрокой);
	
	Объект.Период.ДатаОкончания = КонецМесяца(ПериодНаФорме);
	Объект.Период.ДатаНачала = НачалоМесяца(ПериодНаФорме);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииНачалоВыбораЗавершение(ВыбранныйПериод, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйПериод <> Неопределено Тогда
		
		ПериодНаФорме = ВыбранныйПериод;
		МесяцСтрокой = ОбщегоНазначенияУТКлиентСервер.ПолучитьПредставлениеПериодаРегистрации(ПериодНаФорме);
		Объект.Период.ДатаОкончания = КонецМесяца(ПериодНаФорме);
		Объект.Период.ДатаНачала = НачалоМесяца(ПериодНаФорме);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
